courseworks/week4/yushengzhao/hw.org
#+TITLE: Homework 3
#+AUTHOR: Yusheng Zhao

* Problem 1: Condition Number
- Assuming the division $a/b$ is keeping $a$ as constant.
\begin{align}
    cond(a/b) & = lim_{\epsilon \to 0^{+}} \sup_{||\delta x|| \le \epsilon}(|\delta f|/|f|) / (|\delta x|/|x|)\\
              & = \frac{ (||-a/b^{2} \delta b||)/ ||(a/b)||}{||\delta b|| / ||b||} \\
              & = 1
\end{align}
- Assuming the division $a/b$ is keeping $b$ as constant
  \begin{align}
    cond(a/b) & = lim_{\epsilon \to 0^{+}} \sup_{||\delta x|| \le \epsilon}(|\delta f|/|f|) / (|\delta x|/|x|)\\
              & = \frac{||\delta a/b||/||a/b||}{||\delta a|| / ||a||} \\
              & = 1
  \end{align}

* Problem 2:
#+begin_src julia :exports both :results output
begin
    using LinearAlgebra
    a = [10^10 0; 0 10^-10]
    b = [10^10 0; 0 10^10]
    c = [10^-10 0; 0 10^-10]
    d = [1 2; 2 4]
    mtxs = [a, b, c, d]
    for (mtx,name) in zip(mtxs,["a" "b" "c" "d"])
        cond_num = cond(mtx)
        if cond(mtx) > 10
            println("Matrix $name is ill-conditioned with condition number: $cond_num")
        else
            println("Matrix $name is well-conditioned with condition number: $cond_num")
        end
    end
end
#+end_src

#+RESULTS:
: Matrix a is ill-conditioned with condition number: 1.0e20
: Matrix b is well-conditioned with condition number: 1.0
: Matrix c is well-conditioned with condition number: 1.0
: Matrix d is ill-conditioned with condition number: 2.517588727560788e16

* Problem 3
    #+begin_src  sh :exports both :results output
       julia gauss_jordan.jl
    #+end_src

    #+RESULTS:
    : Hello
    : Test Summary: | Pass  Total  Time
    : Gauss Jordan  |    1      1  1.3s
