courseworks/week4/yushengzhao/hw.tex
% Created 2023-03-07 Tue 13:59
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Yusheng Zhao}
\date{\today}
\title{Homework 3}
\hypersetup{
 pdfauthor={Yusheng Zhao},
 pdftitle={Homework 3},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Problem 1: Condition Number}
\label{sec:orgcd07389}
\begin{itemize}
\item Assuming the division \(a/b\) is keeping \(a\) as constant.
\end{itemize}
\begin{align}
    cond(a/b) & = lim_{\epsilon \to 0^{+}} \sup_{||\delta x|| \le \epsilon}(|\delta f|/|f|) / (|\delta x|/|x|)\\
              & = \frac{ (||-a/b^{2} \delta b||)/ (a/b)}{||\delta b|| / ||b||} \\
              & = 1
\end{align}
\begin{itemize}
\item Assuming the division \(a/b\) is keeping \(b\) as constant
\begin{align}
  cond(a/b) & = lim_{\epsilon \to 0^{+}} \sup_{||\delta x|| \le \epsilon}(|\delta f|/|f|) / (|\delta x|/|x|)\\
            & = \frac{ (||-a/b^{2} \delta b||)/ (a/b)}{||\delta b|| / ||b||} \\
            & = 1
\end{align}
\end{itemize}

\section{Problem 2:}
\label{sec:org2c8ad3d}
\begin{verbatim}
begin
    using LinearAlgebra
    a = [10^10 0; 0 10^-10]
    b = [10^10 0; 0 10^10]
    c = [10^-10 0; 0 10^-10]
    d = [1 2; 2 4]
    mtxs = [a, b, c, d]
    for (mtx,name) in zip(mtxs,["a" "b" "c" "d"])
        cond_num = cond(mtx)
        if cond(mtx) > 10
            println("Matrix $name is ill-conditioned with condition number: $cond_num")
        else
            println("Matrix $name is well-conditioned with condition number: $cond_num")
        end
    end
end
\end{verbatim}

\begin{verbatim}
Matrix a is ill-conditioned with condition number: 1.0e20
Matrix b is well-conditioned with condition number: 1.0
Matrix c is well-conditioned with condition number: 1.0
Matrix d is ill-conditioned with condition number: 2.517588727560788e16
\end{verbatim}

\section{Problem 3}
\label{sec:org856313b}
\begin{verbatim}
       julia gauss_jordan.jl
\end{verbatim}

\begin{verbatim}
Test Summary: | Pass  Total  Time
Gauss Jordan  |    1      1  1.3s
\end{verbatim}
\end{document}